openfoam_cases/backwardFacingStep2D/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-8 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (44.2 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    "(lowerWallStartup|upperWallStartup)"
    {
        type            symmetryPlane;
    }

    "(upperWall|lowerWall)"
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
